---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.AllowMultipleServiceSizes
source: html/e117fda8-95e5-9745-1958-6ab051951588.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.AllowMultipleServiceSizes Property

State flag to allow multiple services to include the same size.

## Syntax (C#)
```csharp
public bool AllowMultipleServiceSizes { get; set; }
```